#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/son-org/son-workspace/runs/run-4r1VjX75JVcWgGSC

Waiting for the plan to start...

Terraform v1.4.6
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.read_s3_user will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "read_s3_user" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "ListBucket"
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "GetObject"
        }
    }

  # aws_iam_user.read_s3_user will be created
  + resource "aws_iam_user" "read_s3_user" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "read-s3-user"
      + path          = "/"
      + tags          = {
          + "Application" = "IAMUser"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "read-s3-user"
          + "Owner"       = "Son"
        }
      + tags_all      = {
          + "Application" = "IAMUser"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "read-s3-user"
          + "Owner"       = "Son"
        }
      + unique_id     = (known after apply)
    }

  # aws_iam_user_policy.read_s3_user_policy will be created
  + resource "aws_iam_user_policy" "read_s3_user_policy" {
      + id     = (known after apply)
      + name   = "read-s3-user-policy"
      + policy = (known after apply)
      + user   = "read-s3-user"
    }

  # aws_s3_bucket.user will be created
  + resource "aws_s3_bucket" "user" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "user"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Application" = "S3Bucket"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "user"
          + "Owner"       = "Son"
        }
      + tags_all                    = {
          + "Application" = "S3Bucket"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "user"
          + "Owner"       = "Son"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

```

</details>

*Pushed by: @sonkibon, Action: `pull_request`*